In [2]:
import pandas as pd
import psycopg2

In [3]:
def peek_at_table(connection, table, n_rows=10, schema='public'):
    sql = '''
    select * from {schema}."{table}" limit {n_rows}
    '''.format(schema=schema, table=table, n_rows=n_rows)
    df = query_database(connection, sql)
    return df

def query_database(connection, sql):
    cursor = connection.cursor()
    cursor.execute(sql)
    rows = cursor.fetchall()
    columns = [d[0] for d in cursor.description]
    df = pd.DataFrame(rows, columns=columns)
    return df

In [8]:
uri = 'postgres://uo2ciwfoinueg1n0:TWwG8XfwxQIMGwkJir0JfDkqqjrFtzAb@127.0.0.1:7080/rdsbroker_723069ee_da4e_4005_91bb_05ae87d4c572'
connection = psycopg2.connect(uri)

In [15]:
sql = ''' select table_name from information_schema.tables order by 1 '''
df = query_database(connection, sql)

df = peek_at_table(connection, 'company_company')
df[['company_number', 'name', 'id']].head()

,company_number,name,id
0,None,Wolfberry IT Ltd,81ae5222-2694-e511-a84e-e4115bead28a
1,None,Mayura Steels Pvt Ltd,98d1db54-4283-e311-8dfb-e4115bead28a
2,None,"Deckow, Jacobs and Collins|711aaf5e-99ef-413d-...",663540af-b4a6-47a3-90c0-d756264a4570
3,None,Beahan Inc|44a03038-eb33-4c46-b7b0-8090f9ec33db,0e1e0d3f-c198-436e-bd57-514466e3a180
4,05588682,APPLE LTD,ec533dad-f505-4098-bbcb-e19a38e4e754

In [18]:
sql = ''' 
select 
  id as company_id,
  company_number
  
from company_company

where company_number is not null

order by 1

'''

df = query_database(connection, sql)
df.head()

                             company_id company_number
0  00049155-a098-e211-a939-e4115bead28a       00733055
1  001363fb-af48-e411-985c-e4115bead28a       00665702
2  0015e48b-4492-e311-a3d5-e4115bead28a       08198901
3  001ac872-c6d5-e311-8a2b-e4115bead28a         337746
4  001c6dfd-8311-e311-a78e-e4115bead28a       OC305650